core/src/main/resources/order_template/addsub_dynamic.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:oed="http://tot.co.th/totom/interface/oedata">
   <soapenv:Header/>
   <soapenv:Body>
      <oed:SubmitRequest>
         <OrderId>{3}</OrderId>
         <SourceSystemId>OMWeb</SourceSystemId>
         <OrderUserId>{4}</OrderUserId>
         <OrderDateTime>{2}</OrderDateTime>
         <OrderType>SUBMIT</OrderType>
         <OperationCode>ADDSUB</OperationCode>
         <OrderItems>
            <OrderItem>
               <OrderItemType>ACCESS</OrderItemType>
               <OrderItemAction>ADD</OrderItemAction>
               <OrderItemId>ACCESS{3}</OrderItemId>
               <OrderItemParentId/>
            </OrderItem>            
            <OrderItem>
               <OrderItemType>SIM</OrderItemType>
               <OrderItemAction>ADD</OrderItemAction>
               <OrderItemId>SIM{3}</OrderItemId>
               <OrderItemParentId>ACCESS{3}</OrderItemParentId>
               <Attributes>
                  <Attribute>
                     <Name>IMSI</Name>
                     <Value>{1}</Value>
                  </Attribute>
               </Attributes>
            </OrderItem>
            <OrderItem>
               <OrderItemType>MSISDN</OrderItemType>
               <OrderItemAction>ADD</OrderItemAction>
               <OrderItemId>MSISDN{3}</OrderItemId>
               <OrderItemParentId>ACCESS{3}</OrderItemParentId>
               <Attributes>
                  <Attribute>
                     <Name>Number</Name>
                     <Value>{0}</Value>
                  </Attribute>
               </Attributes>
               <OrderItemCode/>
            </OrderItem>           
         </OrderItems>         
      </oed:SubmitRequest>
   </soapenv:Body>
</soapenv:Envelope>